In [1]:
import pandas as pd

### Question 1.

In [3]:
my_series = pd.Series([4, 8, 15, 16, 23, 42])
print(my_series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

### Question 2.

In [4]:
my_list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

my_series = pd.Series(my_list)

print(my_series)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

### Question 3.

In [5]:
import pandas as pd

data = {'Name': ["Alice", "Bob", "Claire"],
        'Age': [25, 30, 27],
        'Gender': ["Female", "Male", "Female"]}

df = pd.DataFrame(data)

print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

### Question 4.

DataFrame is collection of rows, columns & header. Basically DataFrame is a 2d array which behave like database.
And Series a just one column in that dataframe. Means DataFrame containd series.

### Question 5.

There are some functions available -

In [2]:
customer_data = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Emily'],
    'Age': [25, 30, 25, 35, 30],
    'Products Purchased': [3, 2, 4, 1, 2]
})

1. head(): Returns the first 5 rows of the DataFrame.

In [3]:
customer_data.head()

      Name  Age  Products Purchased
0    Alice   25                   3
1      Bob   30                   2
2  Charlie   25                   4
3    David   35                   1
4    Emily   30                   2

In [6]:
customer_data.head(2)

    Name  Age  Products Purchased
0  Alice   25                   3
1    Bob   30                   2

2. tail(): Returns the last 5 rows of the DataFrame.

In [4]:
customer_data.tail()

      Name  Age  Products Purchased
0    Alice   25                   3
1      Bob   30                   2
2  Charlie   25                   4
3    David   35                   1
4    Emily   30                   2

In [5]:
customer_data.tail(2)

    Name  Age  Products Purchased
3  David   35                   1
4  Emily   30                   2

3. describe(): Generates descriptive statistics for the DataFrame. That only works with numeric data

In [7]:
customer_data.describe()

           Age  Products Purchased
count   5.0000            5.000000
mean   29.0000            2.400000
std     4.1833            1.140175
min    25.0000            1.000000
25%    25.0000            2.000000
50%    30.0000            2.000000
75%    30.0000            3.000000
max    35.0000            4.000000

4. drop(): Removes specified rows or columns from the DataFrame.

5. groupby(): Groups the DataFrame by one or more columns.

In [13]:
list(customer_data.groupby('Age'))

[(25,
        Name  Age  Products Purchased
  0    Alice   25                   3
  2  Charlie   25                   4),
 (30,
      Name  Age  Products Purchased
  1    Bob   30                   2
  4  Emily   30                   2),
 (35,
      Name  Age  Products Purchased
  3  David   35                   1)]

6. sort_values(): Sorts the DataFrame by one or more columns.

In [15]:
customer_data.sort_values("Age")

      Name  Age  Products Purchased
0    Alice   25                   3
2  Charlie   25                   4
1      Bob   30                   2
4    Emily   30                   2
3    David   35                   1

In [11]:
customer_data.Age.mean()

29.0

### Question 6.

All three of them mutable. Datafream is 2d array which we can filter or sort or manupulate and same with series. And panel is a 3d array which normally we don't use in general. That is also mutable.

### Question 7.

In [17]:
name = pd.Series(["Madhu", "Aryan"])
age = pd.Series([26, 25])
gender = pd.Series(["M", "M"])

pd.DataFrame({"name": name, "age": age, "gender": gender})

    name  age gender
0  Madhu   26      M
1  Aryan   25      M